temp_passage = """\
영조의 완론 탕평과 달리 정조는 준론 탕평을 지향했다. 이는 당파의 시비를 가리는 문제와도 관련이 있었는데, 영조 시대에는 시비를 가리지 않고 탕평을 쓴 결과 탕평당이라는 게 생겨 왕의 비호 아래 별 짓을 저질렀기 때문이다. 특히 탕평당이 왕과의 혼인 관계를 통해 이루어졌기 때문에 그 세력이 척족 세력이 되어서 영조 말기에는 권력 다툼을 하는 경우가 생기게 되었다.

그래서 정조는 자신의 의리에 참여하는 자들을 중심으로 하는 준론 탕평을 지향하게 되었다.

사실 정조 치세 초반에는 궁료 출신이었던 홍국영이 주도해나갔다. 홍국영은 숙위소를 설치하여 숙위대장을 겸직하고 도승지에 올랐다. 그래서 각 정파의 수장들과 교류를 했으며, 자신의 누이를 후궁으로 삼기도 하였다. 하지만 욕심이 지나친 나머지 송시열의 후손 송덕상과 짜고 완풍군을 후사로 세우려고 하다가 왕실의 극심한 반대에 부딪혀 실각하고 말았다.

그리고 이후 정국은 정조 즉위에 홍국영 못지 않게 영향을 주었던 소론의 서명선이 주도하는 체제가 형성되었다. 노론 남당이 서명선에 의해 쫓겨난 이후 서명선에 대한 태도를 둘러싸고 노론들은 서명선의 정국에 참여하는 세력을 시류에 편승하는 자라는 뜻의 시파로 그렇지 않은 세력의 경우 자신들을 궁벽한 처지의 자라는 뜻의 벽파로 나뉘게 되었다. 또한 소론에서도 서명선과 김상철이 갈라졌고, 남인에서도 채제공과 반채제공파로 나뉘어지게 되었다.

재미있게도 이 과정은 기존에 알고 있던 벽파와 시파 구분과 확실시 차이가 난다. 즉 정조 시기 초반에 벽파와 시파는 정조에 대한 의리보다는 정조의 측근세력이었던 서명선에 대한 태도로 갈라져 있었다. 또한 남인의 채제공도 원래 알고 있던바와 달리 반 시파에 속했다고 보는게 맞다. 어찌 되었든 이 같은 정국 구조는 1788년 영의정에 노론 벽파 김치인, 좌의정에 소론 강경파 이성원, 우의정에 남인 채제공이 임명되면서 분위기가 바뀌게 된다. 정조는 자신의 뜻대로 삼정승을 세 정파에서 고루 등용하는 탕평을 처음으로 실현한 것이다. 하지만 이 과정에서 사도세자에 대한 문제가 거론이 되면서 저절로 사도세자 추숭에 찬성하면서 시류에 편승하는 세력이 시파를 이루게 되었고, 이에 반대하는 세력이 벽파를 이루게 되었다.

정조는 1793년 금등문서를 공개하며 자신의 아버지 사도세자 추숭에 본격적으로 나섰으며, 이와 동시에 모든 세력이 참가하는 화합의 분위기를 만들어내기도 했다. 1795년 을묘년 화성 행차 이후 노론 벽파를 적극적으로 기용하기 시작했다. 또한 정조는 갑자년 상왕 구상을 실천해나가기 시작했다. 즉 1804년 자신이 상왕으로 물러난 이후 자신이 만든 수원 화성에서 자신의 아버지 사도세자에 대한 추왕을 하겠다는 것이다. 하지만 이와 같은 구상은 그동안 벽파와 시파의 중심을 이루고 있었던 남인 채제공과 노론 김종수가 잇달아 사망하였고, 그 과정에서 신하들은 지리한 공방만 이어가게 되었다. 결국 이 시점에서 정조의 건강이 악화 되면서 급작스럽게 사망하게 되었고, 결국 정조가 꿈꾸던 탕평도 그의 죽음과 함께 사라지게 되었다.

이후 정국은 정조 말기 정권을 장악했던 노론 벽파가 그대로 잡으면서 새 국왕 순조의 장인인 김조순이 속한 시파와 남인을 내쫓으면서 다시금 이전의 환국정치 수준으로 돌아가게 되었고, 정순왕후의 사망 이후에는 벽파가 단죄를 당하고 김조순을 중심으로 하는 세도 정치가 펼쳐지게 되었다.
"""

passage = """\
동아시아 지역은 열대 기후부터 한대 기후까지 다양한 기후가 나타나며, 계절풍의 영향을 많이 받는다. 북서풍이 부는 겨울철에는 시베리아, 몽골 등 대륙에서 바다를 향해 바람이 불어 매우 춥고 건조하며, 강수량이 적다. 반면 남동풍이 부는 여름철에는 바다에서 대륙 쪽으로 바람이 불어 덥고 습하며, 강수량이 많은 편이다. 기온과 강수량 등의 기후 요소는 동아시아 각 지역의 식물의 성장과 작물의 재배에 큰 영향을 주었다. 열대와 온대 기후에 속하는 지역에서는 주로 농경이 이루어진다. 농경 지역은 다시 강수량과 기온에 따라 벼농사와 밭농사 지역으로 나누어진다. 연평균 기온이 높고 연간 강수량이 600mm가 넘는 창장강 이남 지역과 한반도 중 남부 일대, 일본 열도, 베트남 전역에서는 주로 벼농사가 이루어지며, 강수량이 상대적으로 적은 화북 지역과 만주 남부 지역, 한반도 북부 지역에서는 주로 밭농사가 이루어진다. 연간 강수량이 400mm 미만이며 토지가 척박한 몽골고원과 티베트 고원 일대에서는 계절에 따라 일정 지역을 순회하며 가축을 기르는 유목이 행해진다. 기온이 낮고 삼림이 많은 한반도의 동북부, 연해주, 시베리아 지역에서는 주로 수렵이나 어로가 이루어진다. 화북 지역 중국의 황허강 하류 지역 일대, 동해 황해 열대 기후, 울란바토르, 베이징, 블라디보스토크, 도쿄, 서울, 하노이 등은 온대 기후, 냉대 기후, 한대 기후, 건조 기후, 고산 기후에 속한다. 동아시아의 다양한 기후 시야 넓히기 세계 다양한 지형과 기후에 적응하며 살아가다 연간 강수량이 250mm 이하인 사막 지역은 강수량보다 증발량이 많아 매우 건조하여 식물이 성장하기가 어렵다. 하지만 이 지역의 사람들은 지하 수로식 관개 시설을 설치하여 생활용수와 농업용수를 얻고 밀, 목화 등을 재배하면서 사막을 녹색으로 바꾸어 나가기도 한다. 온대에 속하는 지중해성 기후 지역의 식생은 온난습윤한 겨울에 성장하고, 고온건조한 여름에는 성장이 어렵다. 따라서 이 지역에서는 강수량이 적어도 성장할 수 있는 올리브, 오렌지 나무 등을 심어 키우는 수목 농업이 발달하였다. 같은 온대에 속하더라도 계절풍의 영향으로 여름에 기온이 높고 강수량이 풍부한 지역은 벼농사에 유리하다. 이러한 기후에 속하는 한반도 중 남부 지역과 창장강 유역에서는 벼농사가 활발하며, 중국 남부의 일부 지역과 베트남 지역, 일본의 규슈 지역 등에서는 벼의 2기작도 이루어진다. 한국의 벼농사 지역(전북 고창) 사우디아라비아의 원형 경작지 스페인의 수목 농업 지역(올리브) 14 I. 동아시아 역사의 시작
"""


def get_passage() -> str:
    return passage
