passage = """영조의 완론 탕평과 달리 정조는 준론 탕평을 지향했다. 이는 당파의 시비를 가리는 문제와도 관련이 있었는데, 영조 시대에는 시비를 가리지 않고 탕평을 쓴 결과 탕평당이라는 게 생겨 왕의 비호 아래 별 짓을 저질렀기 때문이다. 특히 탕평당이 왕과의 혼인 관계를 통해 이루어졌기 때문에 그 세력이 척족 세력이 되어서 영조 말기에는 권력 다툼을 하는 경우가 생기게 되었다.

그래서 정조는 자신의 의리에 참여하는 자들을 중심으로 하는 준론 탕평을 지향하게 되었다.

사실 정조 치세 초반에는 궁료 출신이었던 홍국영이 주도해나갔다. 홍국영은 숙위소를 설치하여 숙위대장을 겸직하고 도승지에 올랐다. 그래서 각 정파의 수장들과 교류를 했으며, 자신의 누이를 후궁으로 삼기도 하였다. 하지만 욕심이 지나친 나머지 송시열의 후손 송덕상과 짜고 완풍군을 후사로 세우려고 하다가 왕실의 극심한 반대에 부딪혀 실각하고 말았다.

그리고 이후 정국은 정조 즉위에 홍국영 못지 않게 영향을 주었던 소론의 서명선이 주도하는 체제가 형성되었다. 노론 남당이 서명선에 의해 쫓겨난 이후 서명선에 대한 태도를 둘러싸고 노론들은 서명선의 정국에 참여하는 세력을 시류에 편승하는 자라는 뜻의 시파로 그렇지 않은 세력의 경우 자신들을 궁벽한 처지의 자라는 뜻의 벽파로 나뉘게 되었다. 또한 소론에서도 서명선과 김상철이 갈라졌고, 남인에서도 채제공과 반채제공파로 나뉘어지게 되었다.

재미있게도 이 과정은 기존에 알고 있던 벽파와 시파 구분과 확실시 차이가 난다. 즉 정조 시기 초반에 벽파와 시파는 정조에 대한 의리보다는 정조의 측근세력이었던 서명선에 대한 태도로 갈라져 있었다. 또한 남인의 채제공도 원래 알고 있던바와 달리 반 시파에 속했다고 보는게 맞다. 어찌 되었든 이 같은 정국 구조는 1788년 영의정에 노론 벽파 김치인, 좌의정에 소론 강경파 이성원, 우의정에 남인 채제공이 임명되면서 분위기가 바뀌게 된다. 정조는 자신의 뜻대로 삼정승을 세 정파에서 고루 등용하는 탕평을 처음으로 실현한 것이다. 하지만 이 과정에서 사도세자에 대한 문제가 거론이 되면서 저절로 사도세자 추숭에 찬성하면서 시류에 편승하는 세력이 시파를 이루게 되었고, 이에 반대하는 세력이 벽파를 이루게 되었다.

정조는 1793년 금등문서를 공개하며 자신의 아버지 사도세자 추숭에 본격적으로 나섰으며, 이와 동시에 모든 세력이 참가하는 화합의 분위기를 만들어내기도 했다. 1795년 을묘년 화성 행차 이후 노론 벽파를 적극적으로 기용하기 시작했다. 또한 정조는 갑자년 상왕 구상을 실천해나가기 시작했다. 즉 1804년 자신이 상왕으로 물러난 이후 자신이 만든 수원 화성에서 자신의 아버지 사도세자에 대한 추왕을 하겠다는 것이다. 하지만 이와 같은 구상은 그동안 벽파와 시파의 중심을 이루고 있었던 남인 채제공과 노론 김종수가 잇달아 사망하였고, 그 과정에서 신하들은 지리한 공방만 이어가게 되었다. 결국 이 시점에서 정조의 건강이 악화 되면서 급작스럽게 사망하게 되었고, 결국 정조가 꿈꾸던 탕평도 그의 죽음과 함께 사라지게 되었다.

이후 정국은 정조 말기 정권을 장악했던 노론 벽파가 그대로 잡으면서 새 국왕 순조의 장인인 김조순이 속한 시파와 남인을 내쫓으면서 다시금 이전의 환국정치 수준으로 돌아가게 되었고, 정순왕후의 사망 이후에는 벽파가 단죄를 당하고 김조순을 중심으로 하는 세도 정치가 펼쳐지게 되었다."""

def get_passage():
  return passage